RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ЖурналСобытий/рдв_ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ЖурналСобытий</name>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеИнтеграции</name>
    <type>
      <types>CatalogRef.рдв_СообщенияИнтеграции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.рдв_События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ЖурналСобытий/ManagerModule.bsl
Функция ЗарегистрироватьСобытие(ИдентификаторСобытия = Неопределено,
								ИдентификаторСообщения = Неопределено,
								ВыгружаемыйОбъект = Неопределено,
								СсылкаНаОбъект = Неопределено,
								Событие,
								ВнешняяСистема = Неопределено,
								ДатаСобытия = Неопределено,
								СообщениеИнтеграции = Неопределено) Экспорт
								
								
	МенеджерЗаписи = РегистрыСведений.рдв_ЖурналСобытий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСобытия = ИдентификаторСобытия;
	МенеджерЗаписи.ИдентификаторСообщения = ИдентификаторСообщения;
	МенеджерЗаписи.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
	МенеджерЗаписи.ДатаСобытия = ?(ЗначениеЗаполнено(ДатаСобытия), ДатаСобытия, ТекущаяДатаСеанса());
	МенеджерЗаписи.СообщениеИнтеграции = СообщениеИнтеграции;
	МенеджерЗаписи.Записать();
								
КонецФункции
